
// Indice di andamento -> studia nel lungo periodo (100 giorni) il numero di cambi di password/nome degli utenti 
// Expected: Il numero di modifiche dovrebbe essere stabile/costante


SecurityEvent
| where TimeGenerated > ago(100d)
| where EventID in (4723, 4724, 4781)
| summarize Count=count() by bin(TimeGenerated, 1d) //daily monitor
//| render barchart(xaxis=TimeGenerated, yaxis=Count)